pierrewillenbrock/cpc464-addon-box-software-stm32/stm32/src/block/sdcard.cpp

#include <block/sdcard.h>

#include <stdlib.h>
#include <errno.h>

#include <bsp/stm32f4xx_gpio.h>
#include <bsp/stm32f4xx_rcc.h>
#include <bsp/stm32f4xx_exti.h>
#include <bsp/stm32f4xx_syscfg.h>
#include <irq.h>
#include <timer.h>
#include <block/msd.h>
#include <block/sdio.h>
#include <deque>

//hardware definitions

#define SD_PWR_PIN GPIO_Pin_8
#define SD_PWR_GPIO GPIOA
#define SD_CD_PIN GPIO_Pin_5
#define SD_CD_GPIO GPIOB
#define SD_CD_EXTI_Line EXTI_Line5
#define SD_CD_EXTI_PortSourceGPIO EXTI_PortSourceGPIOB
#define SD_CD_EXTI_PinSource EXTI_PinSource5
#define SD_PINS1 (GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12)
#define SD_GPIO1 GPIOC
#define SD_PINS2 (GPIO_Pin_2)
#define SD_GPIO2 GPIOD

#define SD_GPIO_RCC (RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD)



// SD standard defintions

#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000U)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000U)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000U)

//voltage window is 3.2-3.3. could try some different values as well.
//3.2-3.4(for +/-5%) is one option, could also try 3.0-3.6 (for +/-10%)
//would be 0x00300000 resp 0x00780000
#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x00100000U)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000U)

#define SD_CS_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000U)
#define SD_CS_ADDR_MISALIGNED          ((uint32_t)0x40000000U)
#define SD_CS_BLOCK_LEN_ERR            ((uint32_t)0x20000000U)
#define SD_CS_ERASE_SEQ_ERR            ((uint32_t)0x10000000U)
#define SD_CS_BAD_ERASE_PARAM          ((uint32_t)0x08000000U)
#define SD_CS_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000U)
#define SD_CS_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000U)
#define SD_CS_COM_CRC_FAILED           ((uint32_t)0x00800000U)
#define SD_CS_ILLEGAL_CMD              ((uint32_t)0x00400000U)
#define SD_CS_CARD_ECC_FAILED          ((uint32_t)0x00200000U)
#define SD_CS_CC_ERROR                 ((uint32_t)0x00100000U)
#define SD_CS_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000U)
#define SD_CS_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000U)
#define SD_CS_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000U)
#define SD_CS_CID_CSD_OVERWRITE        ((uint32_t)0x00010000U)
#define SD_CS_WP_ERASE_SKIP            ((uint32_t)0x00008000U)
#define SD_CS_CARD_ECC_DISABLED        ((uint32_t)0x00004000U)
#define SD_CS_ERASE_RESET              ((uint32_t)0x00002000U)
#define SD_CS_AKE_SEQ_ERROR            ((uint32_t)0x00000008U)
#define SD_CS_ERRORBITS                ((uint32_t)0xFDFFE008U)

int card_present = 0;
static uint32_t timer_handle = 0;
enum { CardNotKnown, Card1, Card2, CardHC } card_type = CardNotKnown;
static int volt_retry = 0;
union {
	uint32_t d[4];
	struct {
		uint32_t one:1;
		uint32_t crc:7;
		uint32_t Manufacturing_date:12;
		uint32_t rsvd:4;
		uint32_t Product_serial_number:32;
		uint32_t Product_revision:8;
		char Product_name[5];
		uint32_t OEM_APP_ID:16;
		uint32_t manufactureer_ID:8;
	} __attribute__((packed));
} card_CID;
union {
	uint32_t d[4];
	struct {
		uint32_t one:1;
		uint32_t crc:7;
		uint32_t rsvd1:2;
		uint32_t file_format:2;
		uint32_t temporary_write_protect:1;
		uint32_t permanent_write_protect:1;
		uint32_t copy_flag:1;
		uint32_t file_format_group:1;
		uint32_t rsvd2:5;
		uint32_t partial_blocks_for_write_allowed:1;
		uint32_t max_write_data_block_length:4;
		uint32_t write_speed_factor:3;
		uint32_t rsvd3:2;
		uint32_t write_protect_group_enable:1;
		uint32_t write_protect_group_size:7;
		uint32_t erase_sector_size:7;
		uint32_t erase_single_block_enable:1;
		uint32_t device_size_multiplier:3;
		uint32_t max_write_current_vdd_max:3;
		uint32_t max_write_current_vdd_min:3;
		uint32_t max_read_current_vdd_max:3;
		uint32_t max_read_current_vdd_min:3;
		uint32_t device_size:12;
		uint32_t rsvd4:2;
		uint32_t DSR_implemented:1;
		uint32_t read_block_misalignment:1;
		uint32_t write_block_misalignment:1;
		uint32_t partial_blocks_for_read_allowed:1;
		uint32_t max_read_data_block_length:4;
		uint32_t card_command_class:12;
		uint32_t max_data_transfer_rate:8;
		uint32_t data_read_access_time_2:8;
		uint32_t data_read_access_time_1:8;
		uint32_t rsvd5:6;
		uint32_t CSD_structure:2;
	} __attribute__((packed)) v1;
	struct {
		uint32_t one:1;
		uint32_t crc:7;
		uint32_t rsvd1:2;
		uint32_t file_format:2;
		uint32_t temporary_write_protect:1;
		uint32_t permanent_write_protect:1;
		uint32_t copy_flag:1;
		uint32_t file_format_group:1;
		uint32_t rsvd2:5;
		uint32_t partial_blocks_for_write_allowed:1;
		uint32_t max_write_data_block_length:4;
		uint32_t write_speed_factor:3;
		uint32_t rsvd3:2;
		uint32_t write_protect_group_enable:1;
		uint32_t write_protect_group_size:7;
		uint32_t erase_sector_size:7;
		uint32_t erase_single_block_enable:1;
		uint32_t rsvd4:1;
		uint32_t device_size:22;
		uint32_t rsvd5:6;
		uint32_t DSR_implemented:1;
		uint32_t read_block_misalignment:1;
		uint32_t write_block_misalignment:1;
		uint32_t partial_blocks_for_read_allowed:1;
		uint32_t max_read_data_block_length:4;
		uint32_t card_command_class:12;
		uint32_t max_data_transfer_rate:8;
		uint32_t data_read_access_time_2:8;
		uint32_t data_read_access_time_1:8;
		uint32_t rsvd6:6;
		uint32_t CSD_structure:2;
	} __attribute__((packed)) v2;
} card_CSD;
union {
	uint8_t d[8]; //card sends MSB first, we need LSB first here.
	uint32_t e[2];
	struct {
		uint32_t reserved_mfg;
		uint32_t reserved:16;
		uint32_t sd_bus_widths:4;//bit 0: supports 1 bit, bit2: supports 4 bits. rest reserved.
		uint32_t sd_security:3; //0: none, 1: unused, 2: v1.01, 3: v2.00, rest reserved.
		uint32_t data_status_after_erase:1;
		uint32_t SD_spec:4; //0:1.0-1.01, 1: 1.10, 2: 2.0
		uint32_t SCR_structure:4; //0: v1
	} __attribute__((packed)) v1;
} card_SCR;
static uint16_t card_rca;
static int card_khz;

void SDcard_Setup() {
	SDIO_Setup();

	RCC_AHB1PeriphClockCmd(SD_GPIO_RCC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	GPIO_InitTypeDef gpio_init;
	GPIO_SetBits(SD_PWR_GPIO, SD_PWR_PIN);//keep it off.
	GPIO_StructInit(&gpio_init);
	gpio_init.GPIO_Pin = SD_PWR_PIN;
	gpio_init.GPIO_Speed = GPIO_Speed_2MHz;
	gpio_init.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_Init(SD_PWR_GPIO, &gpio_init);

	gpio_init.GPIO_Pin = SD_CD_PIN;
	gpio_init.GPIO_Speed = GPIO_Speed_2MHz;
	gpio_init.GPIO_Mode = GPIO_Mode_IN;
	gpio_init.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(SD_CD_GPIO, &gpio_init);
	SYSCFG_EXTILineConfig(SD_CD_EXTI_PortSourceGPIO, SD_CD_EXTI_PinSource);

