pierrewillenbrock/cpc464-addon-box-software-stm32/stm32/src/block/sdcard.cpp
	//setup CD pin edge interrupt
	//check CD pin, then check if we already initialized, if not, initialize sd card. then, fix the edge interrupt and check cd again. if it changed, deinitialize, fix the edge interrupt aso.

	uint32_t irq_save;
	ISR_Disable(irq_save);
	EXTI_InitTypeDef extiinit;
	EXTI_StructInit(&extiinit);
	extiinit.EXTI_Line = SD_CD_EXTI_Line;
	extiinit.EXTI_Mode = EXTI_Mode_Interrupt;
	extiinit.EXTI_Trigger = EXTI_Trigger_Falling;
	extiinit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&extiinit);

	if (GPIO_ReadInputDataBit(SD_CD_GPIO, SD_CD_PIN) == Bit_RESET)
		EXTI_GenerateSWInterrupt(SD_CD_EXTI_Line);

	ISR_Enable(irq_save);

	NVIC_InitTypeDef nvicinit;
	nvicinit.NVIC_IRQChannel = EXTI9_5_IRQn;
	nvicinit.NVIC_IRQChannelPreemptionPriority = 3;
	nvicinit.NVIC_IRQChannelSubPriority = 3;
	nvicinit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&nvicinit);
}

static void SDcard_readSectors(void *unused, struct MSDReadCommand *command);
static void SDcard_writeSectors(void *unused, struct MSDWriteCommand *command);

static struct MSD_Info sdcard_info = {
	0, 512, NULL, SDcard_readSectors, SDcard_writeSectors
};

static void SDcard_init_power(void *unused);
static void SDcard_init_clock(void *unused);
static void SDcard_init_reset();
static void SDcard_init_reset_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_interface_condition();
static void SDcard_init_interface_condition_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_sdcard_probe();
static void SDcard_init_sdcard_probe_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_operation_condition();
static void SDcard_init_operation_condition_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_operation_condition_timer(void *unused);
static void SDcard_init_get_CID();
static void SDcard_init_get_CID_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_set_addr();
static void SDcard_init_set_addr_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_get_CSD();
static void SDcard_init_get_CSD_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_select_card();
static void SDcard_init_select_card_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_get_SCR();
static void SDcard_init_get_SCR_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_set_blocksize();
static void SDcard_init_set_blocksize_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_set_bus_width();
static void SDcard_init_set_bus_width_cmpl(int result, struct SDCommand *unused);
static void SDcard_init_finish();

static void SDcard_init_get_status();
static void SDcard_init_get_status_cmpl(int result, struct SDCommand *unused);

static void SDcard_init_power(void *unused) {
	//irq context: cannot wait here for long. need to drive it using irqs.
	//switch pins back to AF
	GPIO_ResetBits(SD_PWR_GPIO, SD_PWR_PIN);//switch it on

	SDIO_PowerUp();

	timer_handle = Timer_Oneshot(10000, SDcard_init_clock, NULL);
}

static void SDcard_init_clock(void *unused) {
	//irq context: cannot wait here for long. need to drive it using irqs.
	SDIO_ClockEnable();

	SDcard_init_reset();
}

static struct SDCommand command;

static void SDcard_init_reset() {
	command.argument = 0;
	command.command = 0;
	command.responseType = SDCommand::NoResponse;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 0;
	command.data = NULL;
	command.completion = SDcard_init_reset_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_reset_cmpl(int result, struct SDCommand *unused) {
	if (result == SDIO_SystemTimeout)
		return;

	//card is in IDLE state

	SDcard_init_interface_condition();
}

static void SDcard_init_interface_condition() {
	command.argument = 0x000001aa;
	command.command = 8;
	command.responseType = SDCommand::ResponseShort;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_interface_condition_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_interface_condition_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK &&
	    result != SDIO_CommandTimeout) {
		return;
	}

	if (result == SDIO_OK &&
	    (command.response[0] & 0xff) == 0xaa &&
	    (command.response[0] & 0xf00) != 0) {
		//2.0 capable card.
		card_type = Card2;
	} else {
		//not 2.0 capable card.
		card_type = Card1;
	}

	//card is still in IDLE state

	SDcard_init_sdcard_probe();
}

static void SDcard_init_sdcard_probe() {
	command.argument = 0;
	command.command = 55;
	command.responseType = SDCommand::Response1;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_sdcard_probe_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_sdcard_probe_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK) {
		return;
	}

	volt_retry = 0;

	//card is still in IDLE state

	SDcard_init_operation_condition();
}

static void SDcard_init_operation_condition() {
	command.argument = SD_VOLTAGE_WINDOW_SD |
		(card_type == Card2?SD_HIGH_CAPACITY:0);
	command.command = 41 | SDIO_APPCMD;
	command.rca = 0;
	command.responseType = SDCommand::Response3;//no crc
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_operation_condition_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_operation_condition_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK &&
	    result != SDIO_SystemTimeout &&
	    result != SDIO_CommandTimeout &&
	    result != SDIO_CommandCRC &&
	    result != SDIO_CommandMismatch &&
	    result != SDIO_CSError) {
		return;
	}

	if (result == SDIO_SystemTimeout ||
	    result == SDIO_CommandTimeout ||
	    result == SDIO_CommandCRC ||
	    result == SDIO_CommandMismatch ||
	    result == SDIO_CSError) {
		volt_retry++;
		if (volt_retry > 10000)
			return;

		timer_handle = Timer_Oneshot(10000, SDcard_init_operation_condition_timer, NULL);
		return;
	}

	uint32_t response = command.response[0];

	if ((response & 0x80000000U) == 0U) {
		volt_retry++;
		if (volt_retry > 10000)
			return;

		timer_handle = Timer_Oneshot(10000, SDcard_init_operation_condition_timer, NULL);

		return;
	}

	if (response & SD_HIGH_CAPACITY) {
		// hc card
		card_type = CardHC;
	}

	//card is now in READY state

