pierrewillenbrock/cpc464-addon-box-software-stm32/stm32/src/block/sdcard.cpp
	SDcard_init_get_CID();
}

static void SDcard_init_operation_condition_timer(void *unused) {
	SDcard_init_operation_condition();
}

static void SDcard_init_get_CID() {
	//Cmd2: get CID (from all connected cards)
	command.argument = 0;
	command.command = 2;
	command.responseType = SDCommand::ResponseLong;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_get_CID_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_get_CID_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	card_CID.d[3] = command.response[0];
	card_CID.d[2] = command.response[1];
	card_CID.d[1] = command.response[2];
	card_CID.d[0] = command.response[3];

	//card is now in IDENT state

	SDcard_init_set_addr();
}

static void SDcard_init_set_addr() {
	//cmd3: set relative address
	//(card generates a new address for itself)
	command.argument = 0;
	command.command = 3;
	command.responseType = SDCommand::ResponseShort;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_set_addr_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_set_addr_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	uint32_t response_r1 = command.response[0];

	if (response_r1 &(SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) {
		return;
	}

	card_rca = response_r1 >> 16;

	//card is now in STBY state

	SDcard_init_get_CSD();
}

static void SDcard_init_get_CSD() {
	//Cmd9: query CSD
	command.argument = card_rca << 16;
	command.command = 9;
	command.responseType = SDCommand::ResponseLong;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_get_CSD_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_get_CSD_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	card_CSD.d[3] = command.response[0];
	card_CSD.d[2] = command.response[1];
	card_CSD.d[1] = command.response[2];
	card_CSD.d[0] = command.response[3];

	if ((card_CSD.v2.CSD_structure == 0 && card_type == CardHC) ||
	    (card_CSD.v1.CSD_structure == 1 && card_type != CardHC) ||
	    card_CSD.v2.CSD_structure > 1) {
		return;
	}

	if (card_CSD.v1.CSD_structure == 0)
		card_khz = card_CSD.v1.max_data_transfer_rate;
	if (card_CSD.v2.CSD_structure == 1)
		card_khz = card_CSD.v1.max_data_transfer_rate;
	static int Clock_Units[8] = {10, 100, 1000, 10000, 0, 0, 0, 0};
	static int Clock_Mults[16] = { 0, 10, 12, 13, 15, 20, 25, 30,
				       35, 40, 45, 50, 55, 60, 70, 80 };
	card_khz = Clock_Units[(card_khz & 0x7)] *
		Clock_Mults[((card_khz >> 3) & 0xf)];

	//card is still in STBY state

	SDcard_init_select_card();
}

static void SDcard_init_select_card() {
	/* Cmd7: Select card */
	command.argument = card_rca << 16;
	command.command = 7;
	command.responseType = SDCommand::Response1;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_select_card_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_select_card_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	//card is now in TRAN state

	SDcard_init_get_SCR();
}

static void SDcard_init_get_status() {
	command.argument = card_rca << 16;
	command.command = 13;
	command.responseType = SDCommand::Response1;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_get_status_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_get_status_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK) {
		return;
	}

	__BKPT(1);

	SDcard_init_get_SCR();
}

static void SDcard_init_get_SCR() {
	/* ACMD51: Send SCR */
	command.argument = 0;
	command.command = 51 | SDIO_APPCMD;
	command.rca = card_rca;
	command.responseType = SDCommand::Response1;
	command.dataType = SDCommand::DataToSDIO;
	command.retryCounter = 2;
	command.data = &card_SCR.d[0];
	command.datalength = 8;
	command.datablocksize = SDIO_DataBlockSize_8b;
	command.completion = SDcard_init_get_SCR_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_get_SCR_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	for(int i = 0; i < 3; i++) {
		uint8_t t = card_SCR.d[i];
		card_SCR.d[i] = card_SCR.d[7-i];
		card_SCR.d[7-i] = t;
	}

	SDcard_init_set_blocksize();
}

static void SDcard_init_set_blocksize() {
	/* Cmd16: Set Block Size for Card */
	command.argument = 512;
	command.command = 16;
	command.responseType = SDCommand::Response1;
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_set_blocksize_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_set_blocksize_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	SDcard_init_set_bus_width();
}

static void SDcard_init_set_bus_width() {
	if(!(card_SCR.v1.sd_bus_widths & 0x4)) {
		//card does not support wide bus.
		SDIO_ConfigureBus(0, card_khz);

		SDcard_init_finish();
	}

	command.argument = 0x2; //four bits
	command.command = 6 | SDIO_APPCMD;
	command.rca = card_rca;
	command.responseType = SDCommand::Response1;//no crc
	command.dataType = SDCommand::NoData;
	command.retryCounter = 2;
	command.data = NULL;
	command.completion = SDcard_init_set_bus_width_cmpl;

	SDIO_Command(&command);
}

static void SDcard_init_set_bus_width_cmpl(int result, struct SDCommand *unused) {
	if (result != SDIO_OK)
		return;

	SDIO_ConfigureBus(1, card_khz);

	SDcard_init_finish();
}

static void SDcard_init_finish() {
	//card init done.
	if (card_CSD.v1.CSD_structure == 0) {
		//v1.0
		sdcard_info.size = (card_CSD.v1.device_size+1)*(4 << card_CSD.v1.device_size_multiplier)*(1 << card_CSD.v1.max_read_data_block_length);
	} else if (card_CSD.v1.CSD_structure == 1) {
		sdcard_info.size = (card_CSD.v2.device_size+1)*512;
	} else {
		return; //hmm. this card appears to be newer than we support.
	}
	MSD_Register(&sdcard_info);
}

