pierrewillenbrock/cpc464-addon-box-software-stm32/stm32/src/block/sdcard.cpp
static void SDcard_deinit() {
	//switch pins back to input only
	GPIO_SetBits(SD_PWR_GPIO, SD_PWR_PIN);//switch it off.

	SDIO_PowerDown();

	MSD_Unregister(&sdcard_info);
}

void EXTI9_5_IRQHandler() {
	if (EXTI_GetITStatus(SD_CD_EXTI_Line) == SET) {
		EXTI_ClearFlag(SD_CD_EXTI_Line);
		EXTI_ClearITPendingBit(SD_CD_EXTI_Line);
		if (!card_present) {
			if (GPIO_ReadInputDataBit(SD_CD_GPIO, SD_CD_PIN) == Bit_SET)
				return;

			card_present = 1;

			EXTI_InitTypeDef extiinit;
			EXTI_StructInit(&extiinit);
			extiinit.EXTI_Line = SD_CD_EXTI_Line;
			extiinit.EXTI_Mode = EXTI_Mode_Interrupt;
			extiinit.EXTI_Trigger = EXTI_Trigger_Rising;
			extiinit.EXTI_LineCmd = ENABLE;
			EXTI_Init(&extiinit);

			//init the card here.
			timer_handle = Timer_Oneshot(100, SDcard_init_power,
						     NULL);
			//notify anyone needing to know the card appeared.

			if (GPIO_ReadInputDataBit(SD_CD_GPIO, SD_CD_PIN) == Bit_SET) {
				//card disappeared. make sure we get the irq.
				EXTI_GenerateSWInterrupt(SD_CD_EXTI_Line);
			}
		} else {
			if (GPIO_ReadInputDataBit(SD_CD_GPIO, SD_CD_PIN) == Bit_RESET)
				return;

			card_present = 0;

			if (timer_handle) {
				Timer_Cancel(timer_handle);
				timer_handle = 0;
			}

			EXTI_InitTypeDef extiinit;
			EXTI_StructInit(&extiinit);
			extiinit.EXTI_Line = SD_CD_EXTI_Line;
			extiinit.EXTI_Mode = EXTI_Mode_Interrupt;
			extiinit.EXTI_Trigger = EXTI_Trigger_Rising;
			extiinit.EXTI_LineCmd = ENABLE;
			EXTI_Init(&extiinit);

			SDcard_deinit();
			//notify anyone needing to know the card disappeared.

			if (GPIO_ReadInputDataBit(SD_CD_GPIO, SD_CD_PIN) == Bit_RESET) {
				//card reappeared. make sure we get the irq.
				EXTI_GenerateSWInterrupt(SD_CD_EXTI_Line);
			}
		}
	}
}

static void SDcard_read_sectors2(struct MSDReadCommand *command);
static void SDcard_read_sectors2_cmpl(int result, struct SDCommand *sdcommand);
static void SDcard_read_sectors3(struct MSDReadCommand *command);
static void SDcard_read_sectors3_cmpl(int result, struct SDCommand *sdcommand);
static void SDcard_write_sectors2(struct MSDWriteCommand *command);

struct SDcard_rwCommand{
  MSDReadCommand *readcmd;
  MSDWriteCommand *writecmd;
};

static SDcard_rwCommand currentCommand = {NULL, NULL};
static std::deque<SDcard_rwCommand> commandQueue;

static void SDcard_dequeueNextCommand() {
	ISR_Guard g;
	if (commandQueue.empty()) {
		currentCommand.readcmd = NULL;
		currentCommand.writecmd = NULL;
		return;
	}
	currentCommand = commandQueue.front();
	commandQueue.pop_front();
	if (currentCommand.readcmd) {
		SDcard_read_sectors2(currentCommand.readcmd);
	}
	if (currentCommand.writecmd) {
		SDcard_write_sectors2(currentCommand.writecmd);
	}
}

static void SDcard_readSectors(void *unused, struct MSDReadCommand *command) {
	ISR_Guard g;
	if (currentCommand.readcmd || currentCommand.writecmd) {
		SDcard_rwCommand c = {command , NULL};
		commandQueue.push_back(c);
	} else {
		currentCommand.readcmd = command;
		SDcard_read_sectors2(command);
	}
}

static void SDcard_read_sectors2(struct MSDReadCommand *command) {
	if (card_type == CardHC) {
		command->sdcard.sdcommand.argument = command->start_block;
	} else {
		command->sdcard.sdcommand.argument = command->start_block * 512;
	}
	if (command->num_blocks > 1) {
		/* Send CMD18 READ_MULT_BLOCK */
		command->sdcard.sdcommand.command = 18;
	} else {
		/* Send CMD17 READ_SINGLE_BLOCK */
		command->sdcard.sdcommand.command = 17;
	}
	command->sdcard.sdcommand.rca = card_rca;
	command->sdcard.sdcommand.responseType = SDCommand::Response1;
	command->sdcard.sdcommand.retryCounter = 2;
	command->sdcard.sdcommand.data = command->dst;
	command->sdcard.sdcommand.datalength = 512*command->num_blocks;
	command->sdcard.sdcommand.datablocksize = SDIO_DataBlockSize_512b;
	command->sdcard.sdcommand.dataType = SDCommand::DataToSDIO;
	command->sdcard.sdcommand.completion = SDcard_read_sectors2_cmpl;

	SDIO_Command(&command->sdcard.sdcommand);
}

static void SDcard_read_sectors2_cmpl(int result, struct SDCommand *sdcommand) {
	struct MSDReadCommand *command = container_of(sdcommand, struct MSDReadCommand, sdcard.sdcommand);
	if (result != SDIO_OK) {
		if (result == SDIO_CommandTimeout)
			command->completion(ETIMEDOUT, command);
		else if (result == SDIO_CSError) {
			if (command->sdcard.sdcommand.response[0] &
			    SD_CS_ADDR_OUT_OF_RANGE)
				command->completion(ENODATA, command); //for write, ENOSPC
			else
				command->completion(EIO, command);
		} else {
			command->completion(EIO, command);
		}
		SDcard_dequeueNextCommand();
		return;
	}

	if (command->num_blocks > 1) {
		SDcard_read_sectors3(command);

		return;
	}

	command->completion(0, command);
	SDcard_dequeueNextCommand();
}

static void SDcard_read_sectors3(struct MSDReadCommand *command) {
	/* Cmd12: STOP_TRANSMISSION */
	command->sdcard.sdcommand.argument = 0;
	command->sdcard.sdcommand.command = 12;
	command->sdcard.sdcommand.responseType = SDCommand::Response1;
	command->sdcard.sdcommand.dataType = SDCommand::NoData;
	command->sdcard.sdcommand.retryCounter = 2;
	command->sdcard.sdcommand.data = NULL;
	command->sdcard.sdcommand.completion = SDcard_read_sectors3_cmpl;

	SDIO_Command(&command->sdcard.sdcommand);
}

static void SDcard_read_sectors3_cmpl(int result, struct SDCommand *sdcommand) {
	struct MSDReadCommand *command = container_of(sdcommand, struct MSDReadCommand, sdcard.sdcommand);
	if (result != SDIO_OK) {
		if (result == SDIO_CommandTimeout)
			command->completion(ETIMEDOUT, command);
		else
			command->completion(EIO, command);
		SDcard_dequeueNextCommand();
		return;
	}

	command->completion(0, command);
	SDcard_dequeueNextCommand();
}

static void SDcard_writeSectors(void *unused, struct MSDWriteCommand *command) {
	ISR_Guard g;
	if (currentCommand.readcmd || currentCommand.writecmd) {
		SDcard_rwCommand c = { NULL, command };
		commandQueue.push_back(c);
	} else {
		currentCommand.writecmd = command;
		SDcard_write_sectors2(command);
	}
}

static void SDcard_write_sectors2(struct MSDWriteCommand *command) {
	command->completion(-1, command);
	SDcard_dequeueNextCommand();
}
